
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11766548679)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.repositories[&#34;tfgh&#34;].github_repository.this
  * module.repositories[&#34;tfgh&#34;].github_repository_ruleset.this
* Replace
  * module.repositories[&#34;tfgh&#34;].github_repository_pull_request.managed


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["tfgh"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "tfgh"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "tfgh"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced, as requested
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "f41f5344370746ca156db6ca908fdc5469d44377" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "11fa0dfcaa1db9362e1fd042f2b2494e696371ea" -> (known after apply)
      ~ id                    = "hayas1:tfgh:51" -> (known after apply)
      ~ labels                = [
          - "destroy",
          - "maintenance",
          - "manual",
        ] -> (known after apply)
      ~ number                = 51 -> (known after apply)
      ~ opened_at             = 1731250700 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731251080 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_ruleset.this will be updated in-place
  ~ resource "github_repository_ruleset" "this" {
        id          = "2558597"
        name        = "default"
        # (6 unchanged attributes hidden)

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ allow_merge_commit          = true -> false
      ~ allow_rebase_merge          = true -> false
      ~ allow_squash_merge          = true -> false
      ~ delete_branch_on_merge      = true -> false
      ~ etag                        = "W/\"06de412a3b9e308ed13de1b0732dc7e4e7f928daa740cdb01fe2d152ca35d2ee\"" -> "W/\"8453c98d637a1892a249cafd4ba299a47d80dae632a3259992ce615a063ccf35\""
        id                          = "tfgh"
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
        name                        = "tfgh"
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":50,"Program":"tfcmt","SHA1":"0146c318a3fe9b7feb61e35366068a988fee10d0","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->